//REV$UNLD JOB (),'GET REVIEW DATA SETS',CLASS=A,MSGCLASS=H,
//             REGION=4M,NOTIFY=&SYSUID,COND=(0,NE)
//*
//*  WELCOME TO THE 2024 SUGGESTED METHOD FOR EXTRACTING THE
//*  LATEST RELEASE OF THE REVIEW/RFE PACKAGE FROM CBT FILE 134.
//*
//*
//*  THIS JOB PERFORMS RECEIVE COMMAND PROCESSING TO RESTORE
//*  THE VARIOUS REVIEW LIBRARIES, WHICH ARE:
//*
//*  REVASM   -> REVIEW.ASM    - THE SOURCE CODE PLUS JCL PLUS
//*                              THE REVPROF ISPF PROFILE MEMBER.
//*
//*  REVCLIST -> REVIEW.CLIST  - VARIOUS CLISTS, SOME OF WHICH
//*                              MAY BE INVOKED BY REVIEW/RFE
//*                              TO PERFORM USER REQUESTS.
//*
//*  REVDATA  -> REVIEW.DATA   - VARIOUS SAMPLE JOBS FOR INSTALLATION,
//*                              PLUS THE CUMULATIVE RELEASE NOTES,
//*                              PLUS ANOTHER COPY OF THE REVPROF
//*                              ISPF PROFILE MEMBER.
//*
//*  REVHELP  -> REVIEW.HELP   - TSO HELP MEMBERS SUITABLE FOR
//*                              INSTALLING INTO YOUR SYSHELP
//*                              CONCATENATION.  THIS LIBRARY HAS
//*                              ALIAS MEMBERS.
//*
//*  REVIEWME -> REVIEWME.DATA - VARIOUS SAMPLE PICTURES TO ILLUSTRATE
//*                              REVIEW'S SUPPORT OF 3270 GRAPHICS.
//*                              IF 3270 GRAPHICS ARE NOT AVAILABLE
//*                              EACH PIXEL WILL OCCUPY A CHARACTER
//*                              LOCATION, AND GIF ANIMATION WILL BE
//*                              IGNORED.
//*
//*  REVPLIB  -> REVIEW.PANELS - ISPF PANELS.  TO LET REVIEW RUN AS
//*                              AN ISPF DIALOG (IF YOU WANT) COPY
//*                              THESE PANELS TO AN ISPPLIB DATA SET
//*                              AND COPY REVPROF TO YOUR USER ID'S
//*                              ISPPROF LIBRARY.
//*
//*  REVZLOAD -> REVIEWZ.LOAD  - THE READY-TO-USE Z/OS LOAD MODULES.
//*                              THIS LIBRARY HAS ALIAS MEMBERS.
//*
//*
//SAFETY  EXEC PGM=IEFBR14
//REVASM   DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEW.ASM,
//             UNIT=3390,SPACE=(TRK,0)
//REVCLIST DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEW.CLIST,
//             UNIT=3390,SPACE=(TRK,0)
//REVDATA  DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEW.DATA,
//             UNIT=3390,SPACE=(TRK,0)
//REVHELP  DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEW.HELP,
//             UNIT=3390,SPACE=(TRK,0)
//REVIEWME DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEWME.DATA,
//             UNIT=3390,SPACE=(TRK,0)
//REVPLIB  DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEW.PANELS,
//             UNIT=3390,SPACE=(TRK,0)
//REVZLOAD DD  DISP=(NEW,DELETE),DSN=&SYSUID..REVIEWZ.LOAD,
//             UNIT=3390,SPACE=(TRK,0)
//*
//RECEIVE EXEC PGM=IKJEFT01
//SYSTSPRT DD  SYSOUT=*
//REVASM   DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVASM)
//REVCLIST DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVCLIST)
//REVDATA  DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVDATA)
//REVHELP  DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVHELP)
//REVIEWME DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVIEWME)
//REVPLIB  DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVPLIB)
//REVZLOAD DD  DISP=SHR,DSN=&SYSUID..FILE134.PDS(REVZLOAD)
//SYSTSIN  DD  *
RECEIVE INDD(REVASM)

RECEIVE INDD(REVCLIST)

RECEIVE INDD(REVDATA)

RECEIVE INDD(REVHELP)

RECEIVE INDD(REVIEWME)

RECEIVE INDD(REVPLIB)

RECEIVE INDD(REVZLOAD)

/*
//
